#include "alogger.h"

// ========================================================================== //
// Функция установки сообщения.
// ========================================================================== //
void ALogger::info(const char *msg) {
    emit sigInfo(QString("%1: %2").arg(tr("Сообщение")).arg(msg));
}


// ========================================================================== //
// Функция установки предупреждения.
// ========================================================================== //
void ALogger::warn(const char *msg) {
    emit sigWarn(QString("%1: %2").arg(tr("Предупреждение")).arg(msg));
}


// ========================================================================== //
// Функция установки ошибки.
// ========================================================================== //
void ALogger::crit(const char *msg) {
    emit sigCrit(QString("%1: %2").arg(tr("Ошибка")).arg(msg));
}


// ========================================================================== //
// Конструктор.
// ========================================================================== //
ALogger::ALogger(QObject *parent) : QObject(parent) {}
